{
    "ru":{
        "level-1":{
            "text1": "Приветствую тебя на борту корабля, космонавт. Поскольку ты еще новичок, тебе еще рано выходить в открытый космос. Для тебя есть другая задача. Ты будешь задавать направления, устанавливать позиции другим космонавтам, чтобы они добрались до своих кораблей. Панель управляется с помощью CSS кода. Для того чтобы указать направление надо использовать flex box.",
            "text2": "Используй свойство <b data-bs-toggle=\"popover\" data-bs-placement=\"top\" title=\"I am popover\" data-bs-content=\"Left popover\"> justify-content </b>, чтобы помочь этому космонавту добраться до своего корабля.",
            "list": [
                "flex-start - элементы выравниваются к началу контейнера (по левой стороне)",
                "flex-end -  элементы выравниваются к концу контейнера (по правой стороне)",
                "center - элементы выравниваются по центру",
                "space-between - между элементами устанавливается одинаковый отступ. Первый и последний элементы прижаты к началу и к концу контейнера.",
                "space-around - вокруг элементов устанавливается одинаковый отступ. Появляется пространство вокруг элементов.",
                "space-evenly - отступы элементов устанавливаются равномерно. Работает как space-around, но элементы прижаты к середине и имеют отступы между собой."
            ]
        },
        "level-2":{
            "text1": "Теперь их двое. Используй justify-content снова, чтобы помочь им добраться до кораблей.",
            "text2": "",
            "list": []
        },
        "level-3":{
            "text1": "Теперь корабли стоят по краям,а космонавты между ними по центру.",
            "text2": "У justify-content как раз имеется нужное нам значение для такого случая.",
            "list": []
        },
        "level-4":{
            "text1": "Используй одно из значений justify-content, чтобы помочь им добраться до кораблей.",
            "text2": "",
            "list": []
        },
        "level-5":{
            "text1": "Используй одно из значений justify-content, чтобы помочь им добраться до кораблей.",
            "text2": "",
            "list": []
        },
        "level-6":{
            "text1": "К команде присоединяется третий космонавт. И они находятся вдали от кораблей. На мониторе видно, что корабли стоят в центре.",
            "text2": "Направь космонавтов в центр к кораблям используя свойство align-items, помимо этого используй justify-content, чтобы выровнить космонавтов по центру.",
            "list": [
                "flex-start - выравнивает элементы по вертикали к началу контейнера (к верхней части)",
                "flex-end - выравнивает элементы по вертикали к концу контейнера (к нижней части)",
                "center - выравнивает элементы по вертикали по центру",
                "baseline - выравнивает элементы по базовой линии",
                "stretch - растягивает элементы занимая все пространство контейнера"
            ]
        },
        "level-7":{
            "text1": " Космонавты отошли от своих кораблей совсем далеко, используй align-items, чтобы они добрались до кораблей.",
            "text2": "",
            "list": []
        },
        "level-8":{
            "text1": "Космонавтам нужна твоя помощь! Помоги им добраться до кораблей используя align-items и justify-content.",
            "text2": "",
            "list": []
        },
        "level-9":{
            "text1": "Помоги космонавтам собраться и дойти до кораблей. Используй align-items, чтобы они добрались.",
            "text2": "",
            "list": []
        },
        "level-10":{
            "text1": " Посмотри на панель, знаешь как выстроить их в колонну? Для этого тебе надо использовать свойство flex-direction.",
            "text2": "На заметку, когда мы устанавливаем значение flex-direction как reverse, то start и end меняются.",
            "list": [
                "row - элементы выравниваются в строку, слева направо (по направлению текста)",
                "row-reverse - элементы выравниваются в обратном порядке, справа налево",
                "column - элементы выравниваются в колонну",
                "column-reverse - элементы выравниваются в колонну, в обратном порядке "
            ]
        },
        "level-11":{
            "text1": "Смотри, корабли выстроены в обратном порядке и находятся далеко от космонавтов. Используй flex-direction и align-items, чтобы они смогли добраться.",
            "text2": "",
            "list": []
        },
        "level-12":{
            "text1": "Помоги космонавтам добраться до корабля.",
            "text2": "Прошу заметить, что когда мы устанавливаем flex-direction как column, justify-content начинает выравнивать по вертикали, а align-items по горизонтали.",
            "list": []
        },
        "level-13":{
            "text1": "Помоги космонавтам используя ранее пройденные тобой свойства. justify-content, align-items, flex-direction",
            "text2": "",
            "list": [
                "justify-content", 
                "align-items",
                "flex-direction"
            ]
        },
        "level-14":{
            "text1": " Космонавты дошли до своих кораблей, но стоят не по порядку. Для того чтобы они встали как надо, используй свойство order.",
            "text2": "В этом примере белый космонавт имеет порядок order 1, розовый космонавт имеет order 2. Какое значение нужно дать белому космонавту, чтобы сместить розового космонавта назад?",
            "list": [
                "Стандартное значение order 0",
                "Можно устанавливать положительные значения order 1, для сдвига вперед", 
                "Можно устанавливать отрицательные  значения order -1, для сдвига назад"
            ]
        },
        "level-15":{
            "text1": "На мониторе видно, что розовый космонавт припарковался  по центру. Для того чтобы направить только розового космонавта к центру используй свойство align-self.",
            "text2": "",
            "list": [
                "flex-start - выравнивает элемент по вертикали к началу контейнера (к верхней части)",
                "flex-end - выравнивает элемент по вертикали к концу контейнера (к нижней части)",
                "center - выравнивает элемент по вертикали по центру",
                "baseline - выравнивает элемент по базовой линии",
                "stretch - растягивает элемент занимая все пространство контейнера"
            ]
        },
        "level-16":{
            "text1": "Синий космонавт оставил свой корабль на первом ряду, в самом конце. Помоги ему добраться до своего корабля.",
            "text2": "",
            "list": []
        },
        "level-17":{
            "text1": "Поменяй порядок розового космонавта и дай направление только ему, чтобы он добрался до своего корабля.",
            "text2": "",
            "list": []
        },
        "level-18":{
            "text1": "У тебя хорошо получается. Если ты в состоянии работать с тремя космонавтами, значит можно тебе доверить и восьмерых!  Сейчас космонавты выстроены в одну линию, в один ряд, чтобы часть из них выстроилась на другую, используй свойство flex-wrap.",
            "text2": "Помимо этого свойства используй align-items, чтобы они встали по центру.",
            "list": [
                "nowrap - элементы выстраиваются в одну линию",
                "wrap - часть элементов переносится на новую строку",
                "wrap-reverse - часть элементов переносится на новую строку, в обратном порядке"
            ]
        },
        "level-19":{
            "text1": "Теперь космонавты выстроились в колонну, помоги космонавтам распределиться по кораблям. Используй свойства flex-wrap, flex-direction, align-items.",
            "text2": "",
            "list": []
        },
        "level-20":{
            "text1": "Встали они конечно красиво, но не по своим кораблям…Распредели их так чтобы каждый стоял на своем корабле.",
            "text2": "",
            "list": []
        },
        "level-21":{
            "text1": "Давай познакомимся с новым свойством которое называется align-content. Align-content похож на align-items, но есть различия. Align-items отвечает за то, как элементы  в целом будут выровнены в контейнере, align-content отвечает за расстояние между рядами элементов, за то, как несколько рядов должны отделяться друг от друга.Также align-content работает только когда есть flex-wrap. То есть когда появляются ряды.",
            "text2": "",
            "list": [
                "flex-start - ряды устанавливаются в верхней части контейнера",
                "flex-end - ряды устанавливаются в нижней части контейнера",
                "center -  ряды устанавливаются по центру",
                "space-between - между рядами появляется расстояние. Первый и последний ряд прижимаются к верхней и нижней части.",
                "space-around - вокруг рядов появляется расстояние.",
                "space-evenly - расстояние элементов устанавливаются равномерно.",
                "stretch - ряды равномерно растягиваются заполняя свободное пространство"

            ]
        },
        "level-22":{
            "text1": "Используй align-content, чтобы ряд встал в нижнюю часть контейнера",
            "text2": "",
            "list": []
        },
        "level-23":{
            "text1": "Помоги космонавтам добраться до кораблей используя align-content и justify-content.",
            "text2": "",
            "list": []
        },
        "level-24":{
            "text1": "Теперь они встали в колонну. Используй align-content и flex-direction, чтобы каждый стоял на своем корабле.",
            "text2": "",
            "list": []
        },
        "level-25":{
            "text1": "Поздравляю, пришла новость о том, что ты можешь выходить в космос и совершать экспедиции по планетам, но перед этим ты должен отработать, осталось немного, это нужно чтобы ты закрепил навыки и смог работать в дальнейшем.",
            "text2": "Используи нужные своиства чтобы космонавты встали по кораблям.",
            "list": [
                "flex-wrap",
                "align-content",
                "flex-direction"
            ]
        },
        "level-26":{
            "text1": "Это твое последнее задание. Покажи мастер класс, тому что ты научился!",
            "text2": "Помоги космонавтам добраться до кораблей и можешь идти в ангар встречать свой собственный корабль.",
            "list": [
                "justify-content",
                "flex-wrap",
                "align-content",
                "flex-direction"
            ]
        }
    },
    "kz":{
        
    },
    "en":{

    }
}